TexasInstruments/motor-control-sdk/examples/tidm_02018_universal_motorcontrol/universal_motorcontrol/src_board/AM263_HVMTRPFC.syscfg
section14.$name                   = "UMC_TCMB";
section14.load_memory             = "R5F_TCMB";
section14.output_section.create(7);
section14.output_section[0].$name = "hal_data";
section14.output_section[1].$name = ".tcm_data";
section14.output_section[2].$name = "user_data";
section14.output_section[3].$name = "foc_data";
section14.output_section[4].$name = "motor_data";
section14.output_section[5].$name = "sys_data";
section14.output_section[6].$name = ".sfradata";

section15.$name                   = "UMC_OCRAM";
section15.load_memory             = "OCRAM";
section15.output_section.create(2);
section15.output_section[0].$name = ".trigData";
section15.output_section[1].$name = ".datalog_data";

epwm_xbar1.$name      = "MTR1_IS_TRIP_CMPSS";
epwm_xbar1.xbarOutput = ["CMPSSB1_CTRIPH","CMPSSB1_CTRIPL","CMPSSB3_CTRIPH","CMPSSB3_CTRIPL"];
epwm_xbar1.instance   = "EPWM_XBAR_6";

input_xbar1.$name      = "CONFIG_CAP_U_XBAR";
input_xbar1.instance   = "INPUT_XBAR_4";
input_xbar1.xbarOutput = "GPIO17";

input_xbar2.$name      = "CONFIG_CAP_V_XBAR";
input_xbar2.instance   = "INPUT_XBAR_5";
input_xbar2.xbarOutput = "GPIO18";

input_xbar3.$name      = "CONFIG_CAP_W_XBAR";
input_xbar3.instance   = "INPUT_XBAR_6";
input_xbar3.xbarOutput = "GPIO16";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC0_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN5.$suggestSolution = "ADC0_AIN5";
adc2.ADC.AIN3.$suggestSolution = "ADC1_AIN3";
adc2.ADC.AIN4.$suggestSolution = "ADC1_AIN4";
adc2.ADC.AIN5.$suggestSolution = "ADC1_AIN5";
adc3.ADC.AIN0.$suggestSolution = "ADC3_AIN0";
adc3.ADC.AIN1.$suggestSolution = "ADC3_AIN1";
adc4.ADC.AIN4.$suggestSolution = "ADC4_AIN4";
epwm1.EPWM.A.$suggestSolution  = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution  = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution  = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution  = "EPWM1_B";
epwm3.EPWM.A.$suggestSolution  = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution  = "EPWM2_B";
epwm4.EPWM.A.$suggestSolution  = "EPWM5_A";
epwm4.EPWM.B.$suggestSolution  = "EPWM5_B";
epwm5.EPWM.A.$suggestSolution  = "EPWM6_A";
epwm5.EPWM.B.$suggestSolution  = "EPWM6_B";
gpio1.GPIO_n.$suggestSolution  = "QSPI_CSn0";
gpio2.GPIO_n.$suggestSolution  = "QSPI_CSn1";
gpio3.GPIO_n.$suggestSolution  = "QSPI_CLK";
mcan1.MCAN.$suggestSolution    = "MCAN0";
mcan1.MCAN.RX.$suggestSolution = "MCAN0_RX";
mcan1.MCAN.TX.$suggestSolution = "MCAN0_TX";
